cask_args appdir: "/Applications"

#Taps
tap "caskroom/cask"
tap "fullscreen/tap"
tap "garethr/kubeval"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "int128/kubelogin"
tap "rcmdnk/file"
tap "techops/tools", "https://git.dapt.to/techops/homebrew-tools.git"

brew "ack"
brew "ansible"
brew "aurora-cli"
brew "autoconf"
brew "aws-rotate-key"
brew "awscli"
brew "bash-completion"
brew "brew-cask-completion"
brew "coreutils"
brew "ctop"
brew "curl"
brew "dnsmasq", restart_service: true
brew "dos2unix"
brew "findutils"
brew "fortune"
brew "fzf"
brew "garethr/kubeval/kubeval"
brew "gcc@5"
brew "git"
brew "glib"
brew "glide"
brew "gnu-tar"
brew "go"
brew "goreleaser"
brew "graphviz"
brew "grc"
brew "harfbuzz"
brew "hub"
brew "jid"
brew "jq"
brew "kind"
brew "kube-ps1"
brew "kubectx"
brew "libmpc"
brew "libressl"
brew "makedepend"
brew "mas"
brew "mr"
brew "mtr"
brew "nmap"
brew "openjdk"
brew "openssh"
brew "pango"
brew "pkg-config"
brew "pre-commit"
brew "pwgen"
brew "pyenv"
brew "python@3.8", link: true
brew "rbenv"
brew "rpm"
brew "ruby-build"
brew "s3cmd"
brew "speedtest-cli"
brew "sslscan"
brew "tcptraceroute"
brew "telnet"
brew "terminal-notifier"
brew "terraform"
brew "tmux"
brew "tree"
brew "unrar"
brew "vim"
brew "watch"
brew "wget"
brew "wireshark", link: false
brew "yarn"
brew "zsh"
brew "zsh-completions"

cask "apache-directory-studio"
cask "docker"
cask "evernote"
cask "gpg-suite"
cask "iterm2"
cask "java"
cask "keepassxc"
cask "meld"
cask "slack"
cask "spectacle"
cask "viscosity"
cask "wireshark"
#mas "Install macOS Catalina", id: 0

#Apptio specific
brew "techops/tools/kingpin-cli"
brew "techops/tools/kube-apptio-clusters"


#Optional packages used at some point

#brew "ag"
#brew "gdbm"
#brew "gmp"
#brew "imagemagick"
#brew "jp2a"
#brew "mpfr"
#brew "nginx"
#brew "node"
#brew "postgresql"
#brew "siege"
#brew "the_silver_searcher"
#brew "vagrant-completion"
#cask "agenda"
#cask "backblaze"
#cask "cloudapp"
#cask "consul-cli"
#cask "dayone-cli"
#cask "drop-to-gif"
#cask "dropbox"
#cask "emacs"
#cask "firefox"
#cask "google-backup-and-sync"
#cask "google-chrome"
#cask "google-trends"
#cask "handbrake"
#cask "keybase"
#cask "muzzle"
#cask "rescuetime"
#cask "sonos"
#cask "spotify"
#cask "transmission"
#cask "tunnelbear"
#cask "vagrant"
#cask "virtualbox"
#cask "vlc"
